{"tumblelog":{"title":"Jeffrey Auriemma","description":"                                                                JavaScript, music, etc.","name":"jdauriemma","timezone":"US\/Central","cname":false,"feeds":[]},"posts-start":0,"posts-total":8,"posts-type":false,"posts":[{"id":"135601832097","url":"http:\/\/jdauriemma.tumblr.com\/post\/135601832097","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/135601832097\/an-overlooked-benefit-of-rem-in-css","type":"regular","date-gmt":"2015-12-20 23:36:51 GMT","date":"Sun, 20 Dec 2015 17:36:51","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1450654611,"format":"html","reblog-key":"IN1X4B2t","slug":"an-overlooked-benefit-of-rem-in-css","regular-title":"An overlooked benefit of rem in CSS","regular-body":"<p>\n<img src=\"http:\/\/i.imgur.com\/sk3UnQy.jpg\" alt=\"css rem\"\/>\nShould I use <code>rem<\/code>, <code>px<\/code>, or (gasp!) <code>em<\/code>?  This debate has lots of nuance and I&rsquo;m not here to choose one for you.  I&rsquo;ve read a lot of good material on the subject thanks in part to my wondeful coworker Moises Montenegro, including <a href=\"http:\/\/benfrain.com\/just-use-pixels\/\">this<\/a> and also <a href=\"https:\/\/mindtheshift.wordpress.com\/2015\/04\/02\/r-i-p-rem-viva-css-reference-pixel\/\">this<\/a> (both articles favor <code>px<\/code>).  Much of the discussion centers around the nuts and bolts of how the browser interprets each unit, but I&rsquo;d like to add another dimension to this discussion: that of payload weight.\n\n<\/p><p>\nNote: this article assumes that you are using some sort of CSS preprocessing: perhaps Sass, LESS or Stylus.  \n<\/p>\n<h3>A note about CSS weight<\/h3>\n<p>\nWhen writing preprocessed CSS, consider the output of what you&rsquo;re writing: it&rsquo;s usually quite predictable.  For example: deep nesting tends to produce larger CSS files.  Consider:\n<\/p>\n<pre class=\"scss\">\n\/* style.scss *\/\n$font-size: 16px;\n\n.container {\n  .another-container {\n    .standard-heading {\n      color: #fff;\n      font-size: $font-size;\n    }\n  }\n}\n<\/pre>\n<pre class=\"css\">\n\/* style.css size: 85B *\/\n.container .another-container .standard-heading {\n  color: #fff;\n  font-size: 16px;\n}\n<\/pre>\n<p>\nAssuming <code>.standard-heading<\/code> is used in the same context everywhere on the page, it is better not to nest it so deep.  Our file becomes lighter weight and our stylesheet more reusable:\n<\/p>\n<pre class=\"scss\">\n$font-size: 16px;\n\n.standard-heading {\n  color: #fff;\n  font-size: $font-size;\n}\n<\/pre>\n<pre class=\"css\">\n\/* style.css size: 55B *\/\n.standard-heading {\n  color: #fff;\n  font-size: 16px;\n}\n<\/pre>\n<p>\nOf course, saving 30 bytes is nothing to write home about.  But keeping these possible savings in mind while writing your application&rsquo;s stylesheets can significantly lighten your CSS payload, keeping page load times down and user experience positive.\n<\/p>\n<h3>Responsive design and media queries<\/h3>\n<p>\nOK, so let&rsquo;s add some design requirements into the mix.  What if your requirement is to scale down font sizes when the viewport is narrower than <code>460px<\/code>?  Here are two approaches:\n<\/p>\n<pre class=\"scss\">\n\/* style.scss *\/\n\n$base-font-size: 16px;\n$small-font-size: 14px;\n$mobile-width: 460px;\n\n@mixin standard-fonts($size: $base-font-size) {\n  p {\n    font-size: $size;\n  }\n  \n  h1 {\n    font-size: $size * 3;\n  }\n  \n  h2 {\n    font-size: $size * 2;\n  }\n  \n  h3 {\n    font-size: $size * 1.5;\n  }\n  \n  footer p {\n    font-size: $size * .8;\n  }\n}\n\n@include standard-fonts();\n\n@media only screen and (max-width: $mobile-width) {\n  @include standard-fonts($small-font-size);\n}\n<\/pre>\n<pre class=\"css\">\n\/* style.css size: 354B *\/\n\np {\n  font-size: 16px;\n}\n\nh1 {\n  font-size: 48px;\n}\n\nh2 {\n  font-size: 32px;\n}\n\nh3 {\n  font-size: 24px;\n}\n\nfooter p {\n  font-size: 12.8px;\n}\n\n@media only screen and (max-width: 460px) {\n  p {\n    font-size: 14px;\n  }\n  h1 {\n    font-size: 42px;\n  }\n  h2 {\n    font-size: 28px;\n  }\n  h3 {\n    font-size: 21px;\n  }\n  footer p {\n    font-size: 11.2px;\n  }\n}\n<\/pre>\n<p>\nThis first approach is simple and effective.  We have satisfied the requirement and our mobile users are experiencing wonderfully optimized font sizes.  We are using <code>px<\/code>, which is universally supported in all browsers.  Why rock the boat?  Consider this:\n<\/p>\n<pre class=\"scss\">\n\/* style.scss *\/\n\n$mobile-width: 460px;\n\nhtml {\n  font-size: 16px;\n  \n  @media only screen and (max-width: $mobile-width) {\n    font-size: 14px;\n  }\n}\n\np {\n  font-size: 1rem;\n}\n\nh1 {\n  font-size: 3rem;\n}\n\nh2 {\n  font-size: 2rem;\n}\n\nh3 {\n  font-size: 1.5rem;\n}\n  \nfooter p {\n  font-size: .8rem;\n}\n<\/pre>\n<pre class=\"css\">\n\/* style.css size: 251B *\/\nhtml {\n  font-size: 16px;\n}\n\n@media only screen and (max-width: 460px) {\n  html {\n    font-size: 14px;\n  }\n}\n\np {\n  font-size: 1rem;\n}\n\nh1 {\n  font-size: 3rem;\n}\n\nh2 {\n  font-size: 2rem;\n}\n\nh3 {\n  font-size: 1.5rem;\n}\n\nfooter p {\n  font-size: .8rem;\n}\n<\/pre>\n<p>\nThe original example using <code>px<\/code> totaled 354 bytes of CSS.  The <code>rem<\/code> example totaled 251 bytes of CSS.  In this context, <code>rem<\/code> allowed us a way to scale our fonts in a media query without the use of redundant CSS output.  These simple optimizations could mean serious reductions in CSS payload when applied to an entire code base.  Of course, if you need to support &lt;=IE8, you&rsquo;re out of luck - <code>rem<\/code> is IE9 and up.\n<\/p>\n<h3>Rem can help in unexpected ways<\/h3>\n<p>\nConsider the benefits <code>rem<\/code> can offer your stylesheets, particularly when scaling values.  You could potentially shave many kB while writing arguably more elegant CSS.\n<\/p>\n<h3>Tweet your thoughts<\/h3>\n<p>\nHow are you using <code>px<\/code> or <code>rem<\/code> in your stylesheets?  Let me know <a href=\"https:\/\/twitter.com\/jbones3000\">@jbones3000<\/a>!\n<\/p>","tags":["web development","sass","less","stylus","css"]},{"id":"135354731842","url":"http:\/\/jdauriemma.tumblr.com\/post\/135354731842","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/135354731842\/how-to-make-teaching-a-better-career-part-2","type":"regular","date-gmt":"2015-12-17 02:26:51 GMT","date":"Wed, 16 Dec 2015 20:26:51","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1450319211,"format":"html","reblog-key":"xRUgwcFk","slug":"how-to-make-teaching-a-better-career-part-2","regular-title":"How to Make Teaching a Better Career, Part 2","regular-body":"<p><a href=\"https:\/\/www.flickr.com\/photos\/cali4beach\/\"><img alt=\"photo by cali4beach via Creative Commons License https:\/\/creativecommons.org\/licenses\/by\/2.0\/#\" src=\"https:\/\/c1.staticflickr.com\/9\/8467\/8104594017_c418712932_z.jpg\"\/><\/a><a href=\"http:\/\/jdauriemma.com\/blog_how-to-make-teaching-a-better-career-part-1\">The first part of this list<\/a> generated a lot of support from teachers and former teachers alike.  Thanks to all for a great discussion.\n\n<\/p><p>\nTeachers enter their profession for a variety of reasons, so this list isn&rsquo;t intended to be exhaustive or representative of all teachers&rsquo; priorities or preferences in their work environment.  I am trying, however, to capture some of the struggles that I have read about, observed and experienced during my six-year teaching career and beyond.  Without further ado, items 1-5 in How to Make Teaching a Better Career:\n<\/p>\n<h3>5. Value all specialties equally<\/h3>\n<p>\nHaving been a music teacher, this one hits close to home for me.  All teachers, though, feel the negative effects of the <em>de facto<\/em> teaching hierarchy.  <strong>There is an unsaid rule in nearly all schools that the most valuable instructional time is that in which students are receiving direct instruction in English literacy or mathematics<\/strong>.  Perhaps &ldquo;unsaid&rdquo; is not the appropriate term, since many school cultures make no pretense about the primacy of those subjects.  The reasons for this are numerous and complicated, but researchers have yet to determine whether there is a correlation between instructional minutes and measurable educational outcomes.  In the meantime, common sense and surveys tell us that when there is an imbalance of authority or priorities between teachers and their colleagues, the work environment suffers.\n<\/p>\n<p>\nFirst of all, math and literacy teachers are the object of the most scrutiny by administrators and school boards.  Their lesson plans are tightly managed, their classes watched like hawks and their quantitiative data studied carefully.  In contrast, less-tested or not-tested subject specialties are often given significantly less thought or feedback.  Their plans are not frequently read; their methodology is not proactively critiqued; their classes are rarely visited or observed.  This imbalance is not fair to either side, particularly when there is no empirical reason to do so.  There is, however, a political reason for this imbalance, having to do with test culture, funding formulas, and misplaced confidence in standardized testing.  More on that later.\n<\/p>\n<p>\nIt doesn&rsquo;t take a genius to understand the impact that this imbalance has on morale.  Literacy and math teachers are much more exposed and subject to criticism; other subjects feel neglected or fear for the continued funding of their teaching position or programs.  Overstressed or underappreciated teachers tend to leave: correcting this imbalance will help keep our teachers happy and in the workforce.\n<\/p>\n<h3>4. Evaluate teachers based on what they do<\/h3>\n<p>\nEveryone wants to get rid of Bad Teachers.  Bad Teachers are&hellip; bad.  Unfortunately, most folks don&rsquo;t have a clear idea of what constitutes a Bad Teacher.  Still, there has been a good deal of public discussion lately about teacher evalution systems, or teacher accountability (a term loaded with passive aggression).  Soapbox: teachers have always been accountable to their students, the families of their students, their colleagues and their administrators.  I digress.  If you know a teacher, talk to them about how they are evaluated, and please get back to me with the number of times they roll their eyes.  In many districts across the US, teachers&rsquo; continued employment is dependant on a formula that carries the veneer of legitimacy and objectivity but is, in reality, a convoluted time suck with little relevance to the craft of teaching.  Convoluted time suck is not a good teacher retention tool.\n<\/p>\n<p>\nLet me go further in depth.  Most public school districts are now using a formula based on wide-eyed optimist education researchers, well-meaning but ignorant philanthropists (rhymes with Pill Skates), and opportunistic politicians.  Compliance with these systems, in my conservative estimate, has probably collectively cost millions of productivity hours.  Hours that could have been spent teaching, planning, or doing otherwise meaningful work.  These formulae are usually based on a weighted average of standardized test scores, some sort of curated before-and-after test score, classroom observations and, in some cases, surveys of students and families.  Sounds really thorough right?  In reality, it&rsquo;s nothing more than a very, very expensive way to do the same things that educators have been doing for years.\n<\/p>\n<p>\n  The standardized test criterion is woefully reflective of the worst possible priorities.  There is literally nothing that you can infer with any degree of significance from one teacher&rsquo;s students&rsquo; standardized tests scores in one year.  Zero.  Nada.  Worse yet, only two subjects are typically associated with these scores.  As a music teacher, my teacher score was based on literacy standardized test scores for the <em>entire school<\/em>.  It&rsquo;s insulting.  The before-and-after assessment refers to giving one&rsquo;s class a test in the beginning of the year (before) and then a similar or identical test at the end of the year (after) to determine the &ldquo;value add&rdquo; that the teacher had on that class&rsquo;s acheivement.  Seems reasonable, until you account for the fact that the teachers themselves give the assessments and grade the assessments.  <strong>If they trust teachers with all that resposibility, why the heck can&rsquo;t they trust teachers to do their jobs<\/strong>?  The assumptions just don&rsquo;t add up.  And finally: observations.  No matter how much training you do, observations are subjective and prone to high variability.  They are probably the most relevant way to judge teachers, but the fact remains that observations can and do get manipulated by biased observers.  Oh, well!\n<\/p>\n<p>\nTeacher evaluation is unfortunately very short on substance.  Let&rsquo;s take a fresh look on what, if anything, these newfangled approaches are really adding to the efficacy of our teaching workforce.  Most teachers don&rsquo;t see it, and that is beyond frustrating when their paychecks and professional pride are on the line.\n<\/p>\n<h3>3. Stop test culture<\/h3>\n<p>\nStandardized tests offer very little utility in the classroom.  Students hate them.  Teachers hate them.  <strong>Standardized tests are poor predictors of just about everything you&rsquo;d want a young person to know upon graduating high school<\/strong>.  Since No Child Left Behind and Race to the Top, a bipartisan coalition of corporations and politicians are systematically organizing our public schools around standardized test administration and outcomes.  This is insane, and teachers know it.\n<\/p>\n<p>\nSince there has been plenty written on this subject at greater depth and breadth than I could hope to use, I&rsquo;ll let Google do the heavy lifting for interested readers.  But I&rsquo;d like to share an anecdote from my own experience as a music teacher to drive the point home.  Much of my curriculum in grades 6, 7, and 8 centered around the use of the web.  Since I didn&rsquo;t have a music room, and most other methods of making music require equipment and soundproofing that our school did not have access to, our laptop cart became the most important musical instrument for these young people.  I found webapps that were instructive and engaging and put together the most meaningful and personal projects I could for my students.\n<\/p>\n<p>\nBut for nine weeks(!) I couldn&rsquo;t use the internet for at least part of the school day.  That&rsquo;s right, as recently as 2014, students in my Chicago public school could not use the internet as part of instruction because it would take away bandwidth from other students who were taking district-mandated standardized testing.  Nine school weeks equals 25% of total school days.  This is simply wrong.  Not only were my students being robbed of a valuable resource, my lesson planning became fragmented and I felt anything but respected and supported as an educated professional.  I know I am not alone in having a story about how standardized testing negatively affected my morale in the workplace.\n<\/p>\n<h3>2. Enforce chain of command<\/h3>\n<p>\n  Chain of command is the principle that problems should be addressed directly with the involved parties first, then escalated if a satisfactory solution cannot be found.  For example, if your neighbor is being too loud, knock on their door and ask them to keep it down before calling the cops.  It&rsquo;s hard to respect the chain of command: it means being proactive and looking problems straight in the eyes.   But it&rsquo;s important.  Parents: if you have a problem, tell the teacher.  Don&rsquo;t run and tattle to the principal first.  But, even more importantly:\n<\/p>\n<p>\n  Administrators, do not allow parents to talk to you about an issue with a teacher without uttering the following: &ldquo;have you spoken to the teacher about it?  Where?  When?  How?&rdquo;  School administrations are the solution to the problem, and the good news is that the solution means less work for you: <strong>stop micromanaging your teachers&rsquo; decisions<\/strong>.  Furthermore, stop entertaining demands to change grades or re-take tests.  Stop changing or micro-managing discipline choices <em>ex post facto<\/em>.  It might not make the angry parent happy, but you will be doing a service to your teachers and the school community by preserving the autonomy and authority of all the adults in the school.  There is a time and a place to help your teachers make sound educational choices, but if you find yourself doing it in the middle of a problem all you&rsquo;ll be doing is frustrating your teacher and telling families that they can push around your faculty.\n<\/p>\n<h3>1. Meaningfully address poverty and racism<\/h3>\n<p>\n  Racism and poverty are perhaps the largest and most overlooked influences on our system.\n<\/p>\n<p>\n  Many politicians bemoan our test score deficiencies relative to other nations.  What they don&rsquo;t say is that our affluent, white public schools are virtually at parity with the rest of the world.  We are providing for those students just fine; it is our students who are of color or living in poverty (or both) that have been underserved.  Poverty is the strongest predictor of nearly all quantified educational outcomes, and this manifests itself in numerous ways throughout the public schools.  In addition, race is correlated with harsher disciplinary action in public schools.  This may add context to why a disproportionately larger amount of the teaching workforce is white as compared with the general population of the US.  This is a very important issue that is bigger than the education industry, but it is number one on this list because poverty and racism are regrettably influential in public schools and are proving to be very difficult to fix.\n<\/p>\n<p>\n  Instead of looking at our society and understanding the complex, insitutional reasons for our perceieved problems in the public schools, though, we have gone ahead and made life much more difficult for so many educators and students.  If we fix this problem - the unequal treatment of poor and\/or black and Latino students - teachers will find a much more satisfying work environment.  After all, equal opportunity for every student is perhaps the loftiest goal of education and perhaps the reason why most teachers got into this profession to begin with.\n<\/p>\n<h3>Keep the conversation going<\/h3>\n<p>\nFeel free to tweet me <a href=\"http:\/\/twitter.com\/jbones3000\">@jbones3000<\/a> for a friendly chat about this or any other subject.  Though I have left my education career and am very happy in my new career, education is still a very strong personal interest of mine.  Teachers: you are awesome!<\/p>","tags":["politics","teaching","education","opinion"]},{"id":"134346418832","url":"http:\/\/jdauriemma.tumblr.com\/post\/134346418832","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/134346418832\/block-helpers-in-ruby-on-rails-views","type":"regular","date-gmt":"2015-12-01 19:30:27 GMT","date":"Tue, 01 Dec 2015 13:30:27","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1448998227,"format":"html","reblog-key":"UZsiZyRP","slug":"block-helpers-in-ruby-on-rails-views","regular-title":"Block helpers in Ruby on Rails views","regular-body":"<p><img src=\"http:\/\/i.imgur.com\/OCD3Hwk.png\" alt=\"Block helpers in Ruby on Rails views\"\/><\/p><p>\nI&rsquo;m still pretty new at Ruby, but my coworker and all-around good guy Derek Schaefer pointed this tip out to me when reviewing a recent pull request of mine.\n<\/p>\n<h3>Context<\/h3>\n<p>\nI am trying to show a visual element side-by-side with a corresponding CSS code snippet.  Using rouge, I apply syntax highlighting to a plain text code sample.\n<\/p>\n<img src=\"https:\/\/i.imgur.com\/MNTgWYK.png\" alt=\"Visual Element\"\/><h3>Before<\/h3>\n<p>\nMy first approach was ugly.  It looked something like this:\n<\/p>\n<pre class=\"html\"><code>\n&lt;!-- view.html.erb --&gt;\n&lt;section class=\"code-sample\"&gt;\n  &lt;div class=\"container\"&gt;\n&lt;%= highlight(\n'.example {\n  color: $example-color;\n}',\n'scss'\n)%&gt;\n  &lt;\/div&gt;\n&lt;\/section&gt;\n<\/code><\/pre>\n<pre class=\"rb\"><code>\n# helper.rb\ndef highlight(language, code)\n  Rouge.highlight(code, language.downcase, 'html').html_safe\nend\n<\/code><\/pre>\n<p>\nNotice how I had to break the indentation in the markup, and how ugly the arguments look.  It was a pain in the neck to write (particularly in my auto-indenting vim setup), and is not pleasant to look at.\n<\/p>\n<h3>After<\/h3>\n<p>\nThere is a better way!  The <code>&amp;block<\/code> keyword allows you to capture a blob of ruby code as a string, resulting in a much prettier way of handling complex content.  Observe:\n<\/p>\n<pre class=\"html\"><code>\n&lt;!-- view.html.erb --&gt;\n&lt;section class=\"code-sample\"&gt;\n  &lt;div class=\"container\"&gt;\n    &lt;%= highlight 'scss' do %&gt;\n      .example {\n        color: $example-color;\n      }\n    &lt;% end %&gt;\n  &lt;\/div&gt;\n&lt;\/section&gt;\n<\/code><\/pre>\n<pre class=\"rb\"><code>\n# helper.rb\ndef highlight(language, &amp;block)\n  code = capture(&amp;block).strip_heredoc.strip\n  Rouge.highlight(code, language.downcase, 'html').html_safe\nend\n<\/code><\/pre>\n<p>\nThis approach is much more intuitive and nicer-looking.  Thanks to Derek for a great tip.  For a more in-depth look at blocks and their general use in ruby, <a href=\"http:\/\/stackoverflow.com\/questions\/814739\/whats-this-block-in-ruby-and-how-does-it-get-passed-in-a-method-here\">this Stack Overflow thread<\/a> had some good information.\n<\/p>\n<h3>Keep the conversation going<\/h3>\n<p>\nAnything to add?  Tweet me <a href=\"http:\/\/twitter.com\/jbones3000\">@jbones3000<\/a>!\n<\/p>","tags":["rails","ruby","web development","rouge"]},{"id":"131180218467","url":"http:\/\/jdauriemma.tumblr.com\/post\/131180218467","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/131180218467\/how-to-make-teaching-a-better-career-part-1","type":"regular","date-gmt":"2015-10-14 22:02:27 GMT","date":"Wed, 14 Oct 2015 17:02:27","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1444860147,"format":"html","reblog-key":"YfW0ypub","slug":"how-to-make-teaching-a-better-career-part-1","regular-title":"How to Make Teaching a Better Career, Part 1","regular-body":"<p><img src=\"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4e\/Applauding_Teacher.jpg\"\/><\/p><p>\nWe all want young people to have a great education in the United States.  Beyond that, the diversity of viewpoints on how to improve education in our country is breathtaking.  No matter what your views are, though, one crucial point in every plan is ensuring that we attract and keep high-quality teachers in the classroom.  Right now, that vital component to good education is in trouble: teacher <strong>turnover is high and job satisfaction is low<\/strong>.  If we expect to retain a competent, effective workforce in our public schools for generations to come, we must make significant changes in how we treat the professionals to whom we entrust our young peoples&rsquo; minds.\n<\/p>\n<p>\nThis list is by no means exhaustive, but I will draw on my personal experience as a former public school teacher as well as some relevant data points to make ten suggestions to improve the teaching profession.  Here we go:\n<\/p>\n<h3>10. More prep time<\/h3><p>\nSources vary on the exact number, but American teachers are in front of students for more hours than teachers in most\/all other countries (depending on your data source).  Most American teachers are in front of students all day, save for a short &ldquo;prep&rdquo; period (30-45 minutes) and lunch.  If you still don&rsquo;t see why that&rsquo;s an issue, imagine you are a project manager who is literally in meetings for the entire work day, yet you are still responsible for a significant amount of employee evaluations, compliance paperwork, phone calls, clerical work and more.  Is a half hour really a reasonable about of time for one to accomplish these tasks?  Here, I&rsquo;ll make it simple.\n<\/p>\n<h4>What you think teachers do<\/h4>\n<ul><li>Teach lesson<\/li>\n<li>Grade papers<\/li>\n<\/ul><h4>What teachers actually do<\/h4>\n<ul><li>Teach lesson<\/li>\n<li>Brady hit Jordan; need to fill out a form (yes, really) so that I can send Brady to the office<\/li>\n<li>No administrator in the building; Brady gets bounced back to class in the middle of the most complicated part of the lesson<\/li>\n<li>Crap, Brady is acting out again because there is literally no immediate consequence for his actions<\/li>\n<li>Spend prep giving Brady a meaningful consequence for his actions while trying to get his parents on the phone but they changed their number and the secretary is out sick today so no phone number and oh god what is life<\/li>\n<li>Grade papers<\/li>\n<li>Write note to Brady&rsquo;s parents<\/li>\n<li>Principal is back<\/li>\n<li>Stay after school to talk to principal about Brady<\/li>\n<li>Grade papers<\/li>\n<li>Modify lesson plans<\/li>\n<li>Write another lesson plan just for Brady because he missed the whole lesson and when he doesn&rsquo;t know what&rsquo;s going on he hits people<\/li>\n<li>Complete random pointless task forced upon you by some idiot in your state&rsquo;s captial that is a glorified TPS Report.<\/li>\n<\/ul><p>\nA teacher has a steady amount of predictable tasks to complete that are essential to learning, for instance: regular contact with families, grading student work, and creating assessments.  But with the thinning of support staff and the huge expansion of administrators&rsquo; job responsibilities, more and more administrative and clerical work is hoisted onto the teacher.  This contributes to burnout and increases turnover rates.  <strong>If we allocate a realistic amount of prep time for teachers, it will improve their satisfaction with their jobs.<\/strong>\n<\/p>\n\n<h3>9. Embrace portability<\/h3>\n<p>\nIt is becoming rare in the private sector to stay with one company for decades.  Whether this is a good thing is in the eye of the beholder, but one thing is clear: <strong>there is nothing to gain and much to lose by leaving one teaching job for another.<\/strong>  Heaven forbid you move to another state where the license requirements are different and you have to deal with the education world&rsquo;s version of the DMV in order to do the same job you&rsquo;ve already been doing for years.\n<\/p>\n<p>\n&ldquo;But teachers get great pensions!&rdquo;  Unless, for some reason, they don&rsquo;t stay in the same place for 25 years.  Imagine that!  I&rsquo;ve paid into two public pension programs.  When I left each, I was able to withdraw just a tiny bit more than the amount of cash I contributed.  I don&rsquo;t think my gains exceeded inflation.  That&rsquo;s a tough pill to swallow - as someone who has moved across the country, this was a big issue that I never really anticipated as a college student.  State and municipal pensions are designed for people who stay in one place, and many talented people don&rsquo;t fit that description.  The profession is alienating them, and not just with outdated retirement plans.\n<\/p>\n<p>\nSeniority is the largest determinant of teacher pay.  The more years you have in a given district, the more dollars you take home each paycheck.  When you leave District A to teach for District B, you don&rsquo;t take your seniority with you.  District B will grant you a fraction of your seniority based on a formula that was determined in a smokey room filled with union bosses and politicians.  This is 99% certain to result in a pay cut.  The teacher will also forfeit their tenure by leaving.  This is the opposite of how it should work.  If you want to encourage a working environment that values teachers, <strong>stop penalizing them for leaving their jobs.<\/strong>  It doesn&rsquo;t stop there: a teacher with <em>too much seniority<\/em> or <em>too much education(!)<\/em> can become radioactive, involuntarily pricing themselves out of job mobility even if they are willing to take a pay cut!  The way salary tables are determined today, a worker cannot try to cut their asking rate in order to secure a new position in a better environment.\n<\/p>\n<p>\nIt&rsquo;s not talked about often, but employee mobility is a deterrent against bad management.  It keeps everyone from taking each other for granted and encourages compromise.  Today, public school teachers have zero credibility when they threaten to quit, because administrations know that they hold all the power.  The grass is never greener on the other side.  Personally speaking, if teaching were a more portable career I may never have started looking for a new career.\n<\/p>\n<h3>8. Distributed budgeting<\/h3>\n<p>\nRaise your hand if you can name a teacher with a donorschoose grant pending or completed in the past year.  OK, put it down.  <strong>Where the hell did we go wrong as a society when we decided teachers need to spend their precious free time seeking patronage?<\/strong>  And yes, often times these donorschoose grants are for NEEDS.\n<\/p>\n<p>\nAs far as I know, public school budgets are released to the public every year.  This does not mean anyone actually knows how the district is spending money.  Here&rsquo;s a hint: so much of it is flushed down the drain.  Most of the waste comes in the form of political patronage - I won&rsquo;t address that here.  There is still a shameful amount of money that is spent needlessly by school districts, though.\n<\/p>\n<p>\nSome of the purchases make sense.  Writing implements, paper, printers, copiers, maintenance, and IT are examples of essential purchases that benefit the school and make sense to purchase en masse.  But there is a great deal of money being spent paying full price (or more) from state-approved vendors on bulk purchases of things that many teachers just don&rsquo;t use.  Meanwhile, stuff that teachers actually do use is often purchased with teachers&rsquo; personal checking accounts, and are often not reimbursed.  Imagine if instead of purchasing 100 smart boards, a district actually took those moneys and let teachers allocate them to the purchase of the goods that made sense for their particular classrooms?  Teachers are amazing bargain shoppers, they will make district dollars go a lot further than a bulk PO can.\n<\/p>\n<h3>7. Sensible teacher education<\/h3>\n<p>\nMany people are surprised when they learn that the vast majority of the hours spent preparing education majors in college is on concerns other than teaching.  This is probably a good thing, because many professors lost touch with the realities of contemporary public school education the moment they cashed their first paycheck from the university.  Still, with student teaching sometimes being as brief as 4 months long in some states, many teachers feel unprepared for their first professional position.\n<\/p>\n<p>\nSure, mentorship programs exist.  I was lucky enough to share a room with a great teacher my first two years on the job, so I had someone with more expertise to lean on.  But for every story like mine, there are many more where a new teacher is matched up with a veteran that does not have the time nor incentive to effectively mentor their protege.  Feeling unprepared and unsupported contributes negatively to job satisfaction.  <strong>Dissatisfied teachers quit<\/strong>.\n<\/p>\n<p>\nThe solution is related to number 10.  Teachers need more time budgeted during the work day in order to accommodate the long list of responsibilities they have that don&rsquo;t involve being in front of a class.  Mentoring new teachers would certainly fall under this umbrella.\n<\/p>\n<h3>6. Protect tenure<\/h3>\n<p>\nBefore you get out your torches and pitchforks, hear me out on this one.  <strong>Tenure is one of the most universally misunderstood and vilified aspects of public service today<\/strong>.  It&rsquo;s also a very important protection that ensures that personnel decisions are made for educational and professional reasons and not for political reasons or nepotism.  For those of you who don&rsquo;t know, public school teacher tenure is a guarantee of due process as a precondition for dismissal from a teaching position.  Different jurisdictions have varying rules for how exactly this is implemented, but it essentially means that firing a tenured teacher requires a paper trail and a hearing proving the teacher is not doing their job up to standards.\n<\/p>\n<p>\n&ldquo;Well, that&rsquo;s not what I heard.&rdquo;  You&rsquo;re right, it&rsquo;s not.  Tenure is not a lifetime employment guarantee, nor is it a license to slack off.  &ldquo;But why do you get due process?  I don&rsquo;t get due process when I get laid off.&rdquo;  Good question!  First of all, teacher layoffs happen.  In the unlikely event that the entire non-tenured workforce is laid off, that doesn&rsquo;t prevent a district from laying off tenured teachers.  Where I taught, such a dismissal is called a Reduction In Force (RIF).  So tenure doesn&rsquo;t prevent a district from responding to declining enrollment, per se.\n<\/p>\n<p>\n&ldquo;But why do you get due process?  If my boss wants to fire me, I get fired.&rdquo;  Well, it depends.  The private sector has rules governing employment termination, and corporate HR offices have their own governance regarding the same.  Teachers aren&rsquo;t seasonal workers, they&rsquo;re not contractors, and they&rsquo;re not wage workers.  They are credentialed, salaried professionals working a permanent position.  Due process is not all that different from certain hurdles that are commonplace in private sector full-time employment.\n<\/p>\n<p>\nBecause public education is built on the unfortunate assumption that teachers want to stay put (see #9), teachers often outlast their administrators, Board of Education personnel and municipal government officers.  The longer a teacher stays, the more expensive they become, and the more value they add to the students and community (this has been studied).  They also tend to become very steadfast advocates for the communities in which they&rsquo;ve invested their careers.  <strong>Teachers with high seniority make nice targets for penny-pinching politicians or new administrators who value compliance more than principled disagreement<\/strong>.\n<\/p>\n<p>\nAnd therein lies the moral hazard: without tenure it would be way too easy to just fire the teacher who disagrees with the principal over the new schedule, or the union rep, or the one on top of the salary guide.  If that practice became commonplace it would demoralize and destabilize the profession.  So I say: if public school teachers are to be compensated according to seniority, and if public school teachers are to be punished for changing jobs (see #9), and if public school teachers are to adhere to educational best practices and not the whims of the administrator or trend du jour, then public school teachers should be able to earn tenure after a certain amount of time.\n<\/p>\n<h3>The rest&hellip; coming soon!<\/h3>\n<p>\nI plan to publish the top five soon.  In the meantime, please feel free to tweet your feedback <a href=\"https:\/\/twitter.com\/jbones3000\">@jbones3000<\/a>!\n<\/p>","tags":["politics","teaching","education","opinion"]},{"id":"114148667592","url":"http:\/\/jdauriemma.tumblr.com\/post\/114148667592","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/114148667592\/tumblr-as-a-cms","type":"regular","date-gmt":"2015-03-20 18:57:16 GMT","date":"Fri, 20 Mar 2015 13:57:16","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1426877836,"format":"html","reblog-key":"Aiy4lGap","slug":"tumblr-as-a-cms","regular-title":"Tumblr as a CMS","regular-body":"<img src=\"http:\/\/jdauriemma.com\/media\/tcms.png\"\/><h4>WordPress problems<\/h4>\n<p>\nI once used WordPress to publish a blog, and why not?  It was and is the go-to CMS and had syndication, organization and a robust community out of the box.  A few months back I was warned about the security risks, but I lazily carried on.\n<\/p>\n<p>\nAs if on cue, my installation suffered a security failure and some jerk broke into my server (quite easily) and inserted a bunch of adware on my site.  That was my sign: I exported my WordPress DB, temporarily shut down my blog and searched for another solution.  I didn’t want to host a framework built on PHP - the risks seemed too high, particularly when considering that WordPress is also built on PHP.\n<\/p>\n<h4>What I needed<\/h4>\n<p>\nOut of the box, my new system needed to have:\n<\/p><ul><li>A stable, modern API<\/li>\n<li>Syndication<\/li>\n<li>Security<\/li>\n<\/ul><p>\nMy fondest wish was to spin up some static page generation magic using node and some interesting modules I’ve come across, but my cheap-o shared server doesn’t support node.  I also strongly considered <a href=\"\/\/help.github.com\/articles\/using-jekyll-with-pages\/\">Github’s Jekyll<\/a>.  In the end, though, I decided to use <a href=\"\/\/tumblr.com\">Tumblr<\/a>.\n<\/p>\n<h4>How I did it<\/h4>\n<p>\nI recently refactored my site as an exercise in building a Backbone app.  One of the nice things about working with Backbone is its elegant way of hooking into APIs and modifying data structures via the <code>parse<\/code> method.  Using the a simple GET request to <a href=\"https:\/\/www.tumblr.com\/docs\/en\/api\/v1\">Tumblr’s v1 API<\/a>, I pull down a well-structured JSON blob with all the data I need to populate a template.  There’s barely any parsing to be done.  Observe:\n<\/p>\n<pre><code>\n\/\/ <a href=\"https:\/\/github.com\/bignimbus\/jdauriemma.com\/blob\/master\/js\/collections\/blog-posts.js\">https:\/\/github.com\/bignimbus\/jdauriemma.com\/blob\/master\/js\/collections\/blog-posts.js<\/a>\n\/\/ collections\/blog-posts.js\ndefine(['models\/post'],\nfunction (PostModel) {\n    'use strict';\n    return Backbone.Collection.extend({\n        \"model\": PostModel,\n        \"url\": 'php\/data\/tumblr.json',\n        \"parse\": function (response) {\n            return response.posts;\n        }\n    });\n});\n<\/code><\/pre>\n<p>\nTumblr’s API is good enough, but I also wanted to create a browse page.  As it stands, there’s no thumbnail or snippet text that we get for free with each post.  So, every blog post model comes with these methods:\n<\/p>\n<pre><code>\n\/\/ <a href=\"https:\/\/github.com\/bignimbus\/jdauriemma.com\/blob\/master\/js\/models\/post.js\">https:\/\/github.com\/bignimbus\/jdauriemma.com\/blob\/master\/js\/models\/post.js<\/a>\n\/\/ models\/post.js\ndefine([], function () {\n    'use strict';\n    return Backbone.Model.extend({\n        \"initialize\": function () {\n            this.setHeroImage();\n            this.setTextSnippet();\n        },\n        \"setHeroImage\": function () {\n            var post = this.get('regular-body'),\n                img = post.slice(post.indexOf('&lt;img '));\n            img = img.slice(0, img.indexOf('&gt;') + 1);\n            this.set('heroImage', img);\n        },\n        \"setTextSnippet\": function () {\n            var post = this.get('regular-body'),\n                text = \/&lt;p&gt;((?:.|[\\r\\n])*?)&lt;\\\/p&gt;\/g.exec(post);\n            text = text[1] &amp;&amp; text[1].replace(\/&lt;(?:.|\\n)*?&gt;\/gm, '');\n            text = text.slice(0, 100) + '...';\n            this.set('snippet', text);\n        }\n    });\n});\n<\/code><\/pre>\n<h4>What the user sees<\/h4>\n<p>\nRight now, it’s pretty basic (I have plans - big plans!).  There are two views: single post, and browse.  Browse can show all of my blog posts, or indexed by tag.\n<\/p>\n<img src=\"http:\/\/jdauriemma.com\/media\/blog-post.png\"\/><br\/><img src=\"http:\/\/jdauriemma.com\/media\/blog-browse.png\"\/><p>\nSo, for the time being, this solution serves my purpose. I&rsquo;m no longer hosting a security risk on my site, and I actually get more control over my content than if I had continued using WordPress.\n<\/p>\n<h4>Tweet me<\/h4>\n<p>\n<a href=\"https:\/\/twitter.com\/jbones3000\">@jbones3000<\/a>\n<\/p>","tags":["tumblr","cms","backbone","javascript","wordpress","blog"]},{"id":"108659409462","url":"http:\/\/jdauriemma.tumblr.com\/post\/108659409462","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/108659409462\/if-bach-wrote-oops-i-did-it-again","type":"regular","date-gmt":"2015-01-20 18:38:00 GMT","date":"Tue, 20 Jan 2015 12:38:00","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1421779080,"format":"html","reblog-key":"xoLiDvsr","slug":"if-bach-wrote-oops-i-did-it-again","regular-title":"If Bach Wrote \"Oops!... I Did It Again\"","regular-body":"<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-britney.jpg\"><img alt=\"bach-britney\" class=\"alignnone size-full wp-image-552\" height=\"416\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-britney.jpg\" width=\"554\"\/><\/a>\n<p>You can&rsquo;t un-see that image.<\/p>\n<pre>\"Oops!...I did it again<br\/><br\/>I played with your heart, got lost in the game<br\/><br\/>Oh baby, baby<br\/><br\/>Oops!...You think I'm in love<br\/><br\/>That I'm sent from above<br\/><br\/>I'm not that innocent\"<br\/><br\/>      - Britney Spears<br\/><br\/><\/pre>\n<p>In my teen years I was too busy listening to Limp Bizkit to notice the hidden gem in Britney&rsquo;s 2000 hit, &ldquo;Oops!&hellip; I Did It Again.&rdquo; Now, no one will ever repeat that fateful mistake again. You&rsquo;re welcome, America.\n<\/p><h4>If Bach Wrote&hellip; Oops!&hellip; I Did It Again<\/h4>\n<p><a href=\"http:\/\/jdauriemma.com\/audio\/mp3\/002IfBachWroteOopsIDidItAgain.mp3\"><img src=\"http:\/\/cdn.flaticon.com\/png\/256\/375.png\"\/><br\/>If Bach Wrote&hellip; Oops!&hellip; I Did It Again<\/a><\/p>\n<h4>Triumphant Return<\/h4>\n<p>I apologize for my long hiatus on new posts - lots of new and exciting things are happening in my personal life right now and I&rsquo;ve had to put writing on the back burner for a bit. But enough about me. <a href=\"http:\/\/jdauriemma.com\/blog\/tag\/if-bach-wrote\/\">If Bach Wrote&hellip;<\/a> (IBW) is a personal project of mine where I regularly pick an iconic tune from pop culture, extract melodic material from it, and compose a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Fugue\">fugue<\/a> with that melody as the <a href=\"http:\/\/jan.ucc.nau.edu\/tas3\/fugueanatomy.html\">subject<\/a>.<\/p><p>So far I&rsquo;ve tackled <a href=\"http:\/\/jdauriemma.com\/blog\/if-bach-wrote-dont-stop-believin\">Journey<\/a> and <a href=\"http:\/\/jdauriemma.com\/blog\/if-bach-wrote-turn-down-for-what\/\">Lil Jon<\/a>, and I&rsquo;ve been pretty surprised with the large audience both pieces have acquired (relative to what I&rsquo;m used to). If you&rsquo;ve listened to those two pieces, thank you! Who knew that <a href=\"http:\/\/en.wikipedia.org\/wiki\/Polyphony\">polyphony<\/a> could still be popular in the 21st century?<\/p>\n<h4>The Original<\/h4>\n<p>For you music readers: <a href=\"#score\">view the score<\/a>.<\/p>\n<p>Bubblegum pop is often given the cold shoulder by musicologists, but the refrain of &ldquo;Oops!&hellip; I Did It Again&rdquo; makes for a fascinating fugue subject. <a href=\"http:\/\/grooveshark.com\/#!\/s\/Oops+I+Did+It+Again\/2M1Qyi?src=5\">Listen here<\/a> - you can skip to 0:50 to hear the refrain, but you&rsquo;d be missing out on some slick bass playing by Thomas Lindberg. <\/p>\n<h4>Analysis<\/h4>\n<p>This piece is a rare five-voice fugue, meaning there are up to five independent melodies happening in parallel. Most composers hesitate to write five-voice fugues (Bach only has a handful to his name): they tend to border on a &ldquo;chorale&rdquo; like sound, which can sound overly &ldquo;vertical&rdquo; and suffer from a lack of true polyphony. On top of that, most fugue subject are either too busy or have to wide of a tonal range to accommodate for five voices. &ldquo;Oops!&hellip; I Did It Again&rdquo; is slow enough (I slowed it down to 60bpm) and compact enough (within a sixth) that I decided to throw caution to the wind and give five voices a shot. Here&rsquo;s what the subject looks like on paper:<\/p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-oops-subject.png\"><img alt=\"IBW Oops I Did It Again Subject\" class=\"size-full wp-image-561\" height=\"91\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-oops-subject.png\" width=\"754\"\/><\/a><p>Subject, in C# minor: i V i VII III i E: V I<\/p>\n<p>The <a href=\"http:\/\/en.wikipedia.org\/wiki\/Fugue#The_exposition\">tonal answer<\/a> is in the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Relative_key\">relative major<\/a>:<\/p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/10\/bach-oops-answer.png\"><img alt=\"IBW Oops I Did It Again Answer\" class=\"size-full wp-image-562\" height=\"84\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/10\/bach-oops-answer.png\" width=\"755\"\/><\/a> <p>Answer, in E major: I V I vi c#: iidim V<\/p>\n<p>The exposition makes use of two <a href=\"http:\/\/en.wikipedia.org\/wiki\/Fugue#The_exposition\">countersubjects<\/a>, but only countersubject 2 is reused in the development section:<\/p><a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-oops-cs1.png\"><img alt=\"IBW Oops I Did It Again Countersubject 1\" class=\"size-full wp-image-559\" height=\"99\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-oops-cs1.png\" width=\"728\"\/><\/a>\n<p>Countersubject 1<\/p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-oops-cs2.png\"><img alt=\"bach-oops-IBW Oops I Did It Again Countersubject 2\" class=\"size-full wp-image-560\" height=\"106\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-oops-cs2.png\" width=\"743\"\/><\/a>\n<p>Countersubject 2<\/p>\n<p>The tonal outline of the piece is:<\/p>\n<ul><li>(mm1) C# minor<\/li>\n<li>(~mm18) E major<\/li>\n<li>(~mm21) A major<\/li>\n<li>(~mm24) F# minor<\/li>\n<li>(~mm27) A major<\/li>\n<li>(mm33) C# minor<\/li>\n<li>(mm44) D# minor<\/li>\n<li>(mm49) B major<\/li>\n<li>(mm52) C# minor<\/li>\n<\/ul><div id=\"score\"><h4>View the Score<\/h4>\n<p><a href=\"http:\/\/www.noteflight.com\/scores\/view\/9cf8626d7922a021768e972251f9d4edc61a6975\">View the full score here<\/a> on Noteflight.<\/p><iframe src=\"http:\/\/www.noteflight.com\/embed\/9cf8626d7922a021768e972251f9d4edc61a6975?scale=1\" style=\"height:500px; width:100%\"><\/iframe>\n<\/div>\n<h4>Tweet me!<\/h4>\n<p>Oops!&hellip; You tweeted me again: <a href=\"https:\/\/twitter.com\/jbones3000\">@jbones3000<\/a><\/p>","tags":["if bach wrote","bach","auriemma","britney spears","baroque","fugue","oops i did it again"]},{"id":"108658261457","url":"http:\/\/jdauriemma.tumblr.com\/post\/108658261457","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/108658261457\/if-bach-wrote-dont-stop-believin","type":"regular","date-gmt":"2015-01-20 18:21:00 GMT","date":"Tue, 20 Jan 2015 12:21:00","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1421778060,"format":"html","reblog-key":"VzGoOmYT","slug":"if-bach-wrote-dont-stop-believin","regular-title":"If Bach Wrote \"Don't Stop Believin'\"","regular-body":"<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-journey.jpg\"><img alt=\"bach journey\" class=\"alignnone size-full wp-image-489\" height=\"409\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/bach-journey.jpg\" width=\"617\"\/><\/a>\n<pre><br\/><br\/>\"Just a small town girl<br\/><br\/>Living in a lonely world<br\/><br\/>She took the midnight train<br\/><br\/>Going anywhere\"<br\/><br\/>          -Journey<br\/><br\/><\/pre>\n<p>Admit it, you were singing along! Not to dismiss the importance of good lyrics, I&rsquo;ve always been more attached to melodies, harmonies and bass lines than lead vocals; I learned all the notes in this song long before I knew all the words. Whether you love Journey&rsquo;s lyrics, instrumentals, or hate Journey entirely, I hope that you enjoy this version of &ldquo;If Bach Wrote.&rdquo;<\/p><h4>If Bach Wrote&hellip; Don&rsquo;t Stop Believin&rsquo;<\/h4>\n<p><a href=\"http:\/\/jdauriemma.com\/audio\/mp3\/001IfBachWroteDontStopBelievin.mp3\"><img src=\"http:\/\/cdn.flaticon.com\/png\/256\/375.png\"\/><br\/>If Bach Wrote &ldquo;Don&rsquo;t Stop Believin&rsquo;&rdquo;<\/a>\n<\/p><h4>Welcome back&hellip;<\/h4>\n<p>To the second installment of <a href=\"http:\/\/jdauriemma.com\/blog\/tag\/if-bach-wrote\/\">If Bach Wrote&hellip;<\/a> (IBW). If Bach Wrote&hellip; (IBW) is a personal project of mine where I regularly pick an iconic tune from pop culture, extract melodic material from it, and compose a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Fugue\">fugue<\/a> with that melody as the <a href=\"http:\/\/jan.ucc.nau.edu\/tas3\/fugueanatomy.html\">subject<\/a>.<\/p>\n<p>A handful of weeks ago I did a <a href=\"http:\/\/en.wikipedia.org\/wiki\/Polyphony\">polyphonic<\/a> treatment of Lil Jon and DJ Snake&rsquo;s <a href=\"http:\/\/jdauriemma.com\/blog\/if-bach-wrote-turn-down-for-what\/\">&ldquo;Turn Down for What&rdquo;<\/a> and was pleasantly surprised by the number of hits it got. People more or less had nice things to say about it, too. So, if you listened: thank you!<\/p>\n<h4>Original<\/h4>\n<p>First, you may want to <a href=\"#score\">view the score<\/a>. I&rsquo;m convinced that all American citizens have this song tattooed on their brains, but just in case you want to hear it ooooone moooore tiiiiime, here&rsquo;s a link to the <a href=\"http:\/\/grooveshark.com\/#!\/s\/Don+t+Stop+Believin\/3WbLGn?src=5\">original recording<\/a>. I decided to take the left-hand half of the piano part from the intro as this fugue&rsquo;s subject and <a href=\"http:\/\/jan.ucc.nau.edu\/tas3\/fugueanatomy.html\">answer<\/a>.\n<\/p><p>In notation:<\/p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.15.57-PM.png\"><img alt=\"IBW Don't Stop Believin Subject\" class=\"size-full wp-image-493\" height=\"89\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.15.57-PM.png\" width=\"841\"\/><\/a><p>Subject, in E major: I V vi IV<\/p><p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.16.18-PM.png\"><img alt=\"IBW Don't Stop Believin Answer\" class=\"size-full wp-image-494\" height=\"94\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.16.18-PM.png\" width=\"834\"\/><\/a><\/p><p>Tonal Answer, in E major: V ii-V42 IV V6<\/p>\n<p>This fugue makes use of two <a href=\"http:\/\/jan.ucc.nau.edu\/tas3\/fugueanatomy.html\">countersubjects<\/a>:<\/p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.25.36-PM.png\"><img alt=\"Countersubject 1\" class=\"size-full wp-image-497\" height=\"84\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.25.36-PM.png\" width=\"829\"\/><\/a><p>Countersubject 1<\/p>\n<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.25.55-PM.png\"><img alt=\"Countersubject 2\" class=\"size-full wp-image-496\" height=\"91\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/08\/Screen-Shot-2014-08-01-at-5.25.55-PM.png\" width=\"486\"\/><\/a><p>Countersubject 2, free counterpoint thereafter<\/p>\n<p>You may notice that Countersubject sounds a tiny bit like the right-hand piano part of the song - this was unintentional but welcome.<\/p>\n<p>The exposition is strict with very little free counterpoint, so it&rsquo;s over fairly quickly for a four-voice fugue. The development begins in measure 17. The subject is stated many times throughout the piece per se, in simplified rhythms, <a href=\"http:\/\/composerstoolbox.wordpress.com\/2011\/09\/26\/tool-17-augmentation-and-diminution\/\">augmented<\/a>, and <a href=\"http:\/\/en.wikipedia.org\/wiki\/Inversion_(music)\">inverted<\/a>. I am particularly proud of measures 49-59, where the subject is iterated concurrently per se and in augmentation.<\/p>\n<p>The tonal outline of the piece is:<\/p>\n<ul><li>(mm1) E major<\/li>\n<li>(mm~25) C# minor<\/li>\n<li>(mm35) A major<\/li>\n<li>(mm41) F# minor<\/li>\n<li>(mm45) A major<\/li>\n<li>(mm49) D major<\/li>\n<li>(mm53) C# minor (Not quite what Bach would do, but I couldn&rsquo;t resist)\n<\/li><li>(mm60) E major<\/li>\n<\/ul><div id=\"score\"><h4>View the score<\/h4><p><a href=\"http:\/\/www.noteflight.com\/scores\/view\/19e01ff4d09ce892f791521745374d2d004f6197\">View the full score here<\/a> on Noteflight.<\/p><iframe src=\"http:\/\/www.noteflight.com\/embed\/19e01ff4d09ce892f791521745374d2d004f6197?scale=1\" style=\"width:100%;height:500px\"><\/iframe><\/div>\n<h4>Tweet me!<\/h4>\n<p>I&rsquo;m on the Twitter: <a href=\"https:\/\/twitter.com\/jbones3000\">@jbones3000<\/a>. Say hey!<\/p>","tags":["if bach wrote","dont stop believin","dont stop believing","journey","bach","baroque","fugue","auriemma"]},{"id":"108311381302","url":"http:\/\/jdauriemma.tumblr.com\/post\/108311381302","url-with-slug":"http:\/\/jdauriemma.tumblr.com\/post\/108311381302\/if-bach-wrote-turn-down-for-what","type":"regular","date-gmt":"2015-01-17 03:04:00 GMT","date":"Fri, 16 Jan 2015 21:04:00","bookmarklet":0,"mobile":0,"feed-item":"","from-feed-id":0,"unix-timestamp":1421463840,"format":"html","reblog-key":"LU2ztpS1","slug":"if-bach-wrote-turn-down-for-what","regular-title":"If Bach Wrote \"Turn Down for What\"","regular-body":"<a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/bachliljon.jpg\"><img alt=\"bachliljon\" class=\"alignnone size-full wp-image-98\" height=\"656\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/bachliljon.jpg\" width=\"812\"\/><\/a>\n<h4>How to Write a Really Boring Music Blog<\/h4>\n<p>When I started this blog a few weeks ago, I resolved to blog about all my interests, not just programming. This obviously presents a challenge: holding an audience whilst writing about a wide variety of mostly unrelated subjects. I love listening to and composing music, so my first thought was to regularly write music reviews and occasionally post an original composition whenever I feel like writing one. Both of those options now seem really uninteresting and offer nothing new in terms of interesting content.<\/p>\n<p>The question lingered: how do I blog about music in a way that&rsquo;&rsquo;s potentially interesting to myself and my intended audience (the internet)? The answer is around 300 years old. I am a huge Bach fan. Not only do I like listening to his music, I also enjoy composing polyphonic music that imitates Bach&rsquo;&rsquo;s style. I have composed more than a handful of fugues (<a href=\"http:\/\/en.wikipedia.org\/wiki\/Fugue\">what&rsquo;&rsquo;s a fugue?<\/a>) in my life and some of them have turned out halfway decent. These fugues are also completely uninteresting to everyone else except music theory nerds.<\/p>\n<p>But lots of people like rap and pop music, so what if I could marry my interest in composing in a centuries-old idiom without boring everyone to death? Ladies and gentlemen, I give you&hellip;<\/p>\n<h4>If Bach Wrote&hellip;<\/h4>\n<p><a href=\"http:\/\/jdauriemma.com\/audio\/mp3\/000IfBachWroteTurnDownforWhat.mp3\"><img src=\"http:\/\/cdn.flaticon.com\/png\/256\/375.png\"\/><br\/>If Bach Wrote &ldquo;Turn Down for What&rdquo;<\/a> <a href=\"http:\/\/www.noteflight.com\/scores\/view\/52c241c3b178ed536a2ca961994176a5f0536125\"><br\/>View the full score here<\/a><\/p>\n<p>This series will be a semi-regular (monthly maybe?) series in which I take a given Top 40 Song, extract melodies from that song, and compose a fugue based on that melody. The title will always be: &ldquo;If Bach Wrote&hellip; [Song Title].&rdquo; Without further ado:<\/p>\n<h3>If Bach Wrote &ldquo;Turn Down for What&rdquo;<\/h3>\n<p>Lil Jon and DJ Snake released &ldquo;Turn Down for What&rdquo; in late 2013 and has since gone platinum and hit #1 on two US Billboard charts. It also has a synthesizer ostinato that is absolutely entrancing:<\/p>\n<p><em>Audio Clip: Lil Jon \/ DJ Snake &ldquo;Turn Down for What&rdquo; (original)<\/em><\/p>\n<ul><li><a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/turndownclip.mp3\">Synth Line<\/a><\/li><\/ul><p>This synth ostinato will serve as the fugue&rsquo;s <a href=\"http:\/\/jan.ucc.nau.edu\/tas3\/fugueanatomy.html\">subject<\/a>. I simplified the <a href=\"http:\/\/en.wikipedia.org\/wiki\/Syncopation\">syncopation<\/a> in the rhythm in order to accommodate the Baroque idiom:<\/p>\n<p><a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/turndown01.jpg\"><img alt=\"Fugue subject\" class=\"size-full wp-image-101\" height=\"91\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/turndown01.jpg\" width=\"338\"\/><\/a><br\/><em>Fugue subject in E minor: i (VI) (V)<\/em><\/p>\n<p>I am using a <a href=\"http:\/\/jan.ucc.nau.edu\/tas3\/fugueanatomy.html\">&ldquo;tonal answer&rdquo;<\/a> that is a bit unconventional:<\/p>\n<p><a href=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/turndown02.jpg\"><img alt=\"Tonal answer in G minor: ii-dim\" class=\"size-full wp-image-102\" height=\"96\" src=\"http:\/\/jdauriemma.com\/blog\/wp-content\/uploads\/2014\/06\/turndown02.jpg\" width=\"292\"\/><\/a><br\/><em>Tonal answer in E minor: iio - (v)<\/em><\/p>\n<p>Most fugues in the minor mode opt for a tonal answer in the relative major or dominant; this, however, answers in the submediant. The piece wastes little time progressing into the development section after the third voice restates the subject. Here is the full audio:<\/p>\n<h4>Final Product<\/h4>\n<p><iframe height=\"500px\" src=\"http:\/\/www.noteflight.com\/embed\/52c241c3b178ed536a2ca961994176a5f0536125?scale=1\" width=\"100%\"><\/iframe><\/p>\n<h4>Feedback, Please!<\/h4>\n<p>Please let me know whether you enjoyed this labor of love\/crunk. Tweet me! <a href=\"https:\/\/twitter.com\/jbones3000\">@jbones3000<\/a>.<a href=\"http:\/\/null\"><\/a><\/p>","tags":["if bach wrote","baroque","bach","auriemma","turn down for what","lil jon","dj snake"]}]}
